; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	thermograph3 - mode
	spectrograph1 - mode
	infrared2 - mode
	thermograph0 - mode
	infrared4 - mode
	groundstation1 - direction
	groundstation0 - direction
	groundstation4 - direction
	groundstation3 - direction
	star2 - direction
	star5 - direction
	planet6 - direction
	phenomenon7 - direction
	planet8 - direction
	phenomenon9 - direction
	phenomenon10 - direction
	planet11 - direction
	planet12 - direction
	phenomenon13 - direction
	star14 - direction
)
(:init
	(supports instrument0 thermograph3)
	(supports instrument0 spectrograph1)
	(supports instrument0 infrared2)
	(calibration_target instrument0 groundstation3)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 groundstation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 phenomenon13)
	(supports instrument2 spectrograph1)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 groundstation3)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 phenomenon9)
	(supports instrument3 infrared4)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 groundstation4)
	(supports instrument4 infrared4)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 groundstation0)
	(supports instrument5 infrared4)
	(supports instrument5 thermograph0)
	(supports instrument5 thermograph3)
	(calibration_target instrument5 groundstation0)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 groundstation3)
	(supports instrument6 spectrograph1)
	(calibration_target instrument6 groundstation4)
	(supports instrument7 infrared4)
	(supports instrument7 spectrograph1)
	(supports instrument7 infrared2)
	(calibration_target instrument7 groundstation0)
	(supports instrument8 thermograph0)
	(supports instrument8 thermograph3)
	(calibration_target instrument8 groundstation4)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 planet12)
	(supports instrument9 infrared2)
	(supports instrument9 thermograph0)
	(supports instrument9 spectrograph1)
	(calibration_target instrument9 groundstation3)
	(supports instrument10 infrared2)
	(calibration_target instrument10 star2)
	(supports instrument11 infrared4)
	(supports instrument11 thermograph0)
	(calibration_target instrument11 star2)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(power_avail satellite4)
	(pointing satellite4 phenomenon9)
)
(:goal (and
	(pointing satellite3 star14)
	(pointing satellite4 phenomenon13)
	(have_image star5 thermograph0)
	(have_image phenomenon7 thermograph3)
	(have_image phenomenon9 thermograph3)
	(have_image phenomenon10 infrared2)
	(have_image planet12 thermograph3)
	(have_image phenomenon13 infrared2)
	(have_image star14 infrared2)
))

)

; plan
1. (switch_on instrument10 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument10)
   goals met: 0 of 9
2. (switch_on instrument8 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument8)
   goals met: 0 of 9
3. (turn_to satellite4 phenomenon10 phenomenon9)
   deleted: (pointing satellite4 phenomenon9)
   added: (pointing satellite4 phenomenon10)
   goals met: 0 of 9
4. (turn_to satellite4 star2 phenomenon10)
   deleted: (pointing satellite4 phenomenon10)
   added: (pointing satellite4 star2)
   goals met: 0 of 9
5. (calibrate satellite4 instrument10 star2)
   added: (calibrated instrument10)
   goals met: 0 of 9
6. (turn_to satellite4 phenomenon10 star2)
   deleted: (pointing satellite4 star2)
   added: (pointing satellite4 phenomenon10)
   goals met: 0 of 9
7. (take_image satellite4 phenomenon10 instrument10 infrared2)
   added: (have_image phenomenon10 infrared2)
   goals met: 1 of 9
8. (turn_to satellite4 phenomenon13 phenomenon10)
   deleted: (pointing satellite4 phenomenon10)
   added: (pointing satellite4 phenomenon13)
   goals met: 2 of 9
9. (take_image satellite4 phenomenon13 instrument10 infrared2)
   added: (have_image phenomenon13 infrared2)
   goals met: 3 of 9
10. (turn_to satellite4 star14 phenomenon13)
   deleted: (pointing satellite4 phenomenon13)
   added: (pointing satellite4 star14)
   goals met: 2 of 9
11. (take_image satellite4 star14 instrument10 infrared2)
   added: (have_image star14 infrared2)
   goals met: 3 of 9
12. (turn_to satellite4 phenomenon13 star14)
   deleted: (pointing satellite4 star14)
   added: (pointing satellite4 phenomenon13)
   goals met: 4 of 9
13. (turn_to satellite3 groundstation4 planet12)
   deleted: (pointing satellite3 planet12)
   added: (pointing satellite3 groundstation4)
   goals met: 4 of 9
14. (calibrate satellite3 instrument8 groundstation4)
   added: (calibrated instrument8)
   goals met: 4 of 9
15. (turn_to satellite3 phenomenon7 groundstation4)
   deleted: (pointing satellite3 groundstation4)
   added: (pointing satellite3 phenomenon7)
   goals met: 4 of 9
16. (take_image satellite3 phenomenon7 instrument8 thermograph3)
   added: (have_image phenomenon7 thermograph3)
   goals met: 5 of 9
17. (turn_to satellite3 phenomenon9 phenomenon7)
   deleted: (pointing satellite3 phenomenon7)
   added: (pointing satellite3 phenomenon9)
   goals met: 5 of 9
18. (take_image satellite3 phenomenon9 instrument8 thermograph3)
   added: (have_image phenomenon9 thermograph3)
   goals met: 6 of 9
19. (turn_to satellite3 planet12 phenomenon9)
   deleted: (pointing satellite3 phenomenon9)
   added: (pointing satellite3 planet12)
   goals met: 6 of 9
20. (take_image satellite3 planet12 instrument8 thermograph3)
   added: (have_image planet12 thermograph3)
   goals met: 7 of 9
21. (turn_to satellite3 star14 planet12)
   deleted: (pointing satellite3 planet12)
   added: (pointing satellite3 star14)
   goals met: 8 of 9
22. (turn_to satellite3 star5 star14)
   deleted: (pointing satellite3 star14)
   added: (pointing satellite3 star5)
   goals met: 7 of 9
23. (take_image satellite3 star5 instrument8 thermograph0)
   added: (have_image star5 thermograph0)
   goals met: 8 of 9
24. (turn_to satellite3 star14 star5)
   deleted: (pointing satellite3 star5)
   added: (pointing satellite3 star14)
   goals met: 9 of 9
